Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpened
Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
Remarks:
This event is raised immediately after Revit has finished opening a linked resource.
Only supports linked resources for following types : Revit; IFC;
It is raised even when a linked resource opening failed.
The LinkedResourceOpened events would not raised if there are no update on linked IFC resources.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpening event will be raised when Revit is just about to
open a linked resource.
Since:
2018

Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpening
Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
Remarks:
This event is raised when Revit is just about to open a linked resource.
Only supports linked resources for following types : Revit; IFC;
The LinkedResourceOpened events would not raised if there are no update on linked IFC resources.
Event is not cancellable.
The linked resource cannot be modified, for it is not opened yet at the time of the event.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpened event will be raised immediately after
linked resource is opened.
Since:
2018

Autodesk.Revit.ApplicationServices.Application.Assets(System.ValueType!Autodesk.Revit.Utility.AssetType!System.Runtime.CompilerServices.IsBoxed)
Returns a set of all the Assets within Revit of special type.
Remarks: Each Asset stores the information for rendering etc.